package Assignment_2;

public class PDF {

    /*مقارنة بين Adjacency Matrix و Adjacency List


    ​1. مصفوفة التجاور (Adjacency Matrix):1

​الشكل: جدول (مصفوفة) كبير يربط كل النقاط ببعضها.
​المساحة: تستهلك ذاكرة كبيرة جداً لأنها تحجز مكان لكل الاحتمالات.
​السرعة: سريعة جداً إذا أردتِ معرفة هل النقطة A مرتبطة بـ B مباشرة.
​متى تستخدم؟: إذا كان الرسم البياني "زحمة" (روابط كثيرة جداً).



​2. قائمة التجاور (Adjacency List):2

​الشكل: قائمة بسيطة لكل نقطة، مكتوب فيها "جيرانها" فقط.
​المساحة: موفرة جداً للذاكرة لأنها لا تخزن إلا الروابط الموجودة فعلياً.
​السرعة: أبطأ قليلاً عند البحث عن رابط محدد لأننا نحتاج للبحث داخل القائمة.
​متى تستخدم؟: إذا كان الرسم البياني "فاضي" (روابط قليلة)، وهذا هو الغالب برمجياً


     */
}
